; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-10)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	infrared0 - mode
	spectrograph1 - mode
	infrared3 - mode
	image4 - mode
	image2 - mode
	Star1 - direction
	GroundStation3 - direction
	Star4 - direction
	Star2 - direction
	Star0 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 image4)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 infrared0)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 infrared3)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument4 spectrograph1)
	(supports instrument4 image4)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star2)
	(supports instrument5 image2)
	(supports instrument5 infrared0)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument6 infrared0)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 image4)
	(supports instrument7 spectrograph1)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star4)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument8 spectrograph1)
	(supports instrument8 image4)
	(calibration_target instrument8 Star4)
	(supports instrument9 infrared3)
	(calibration_target instrument9 Star2)
	(supports instrument10 image2)
	(supports instrument10 image4)
	(calibration_target instrument10 Star0)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet10)
)
(:goal (and
	(pointing satellite4 Planet9)
	(have_image Planet5 image4)
	(have_image Star6 infrared3)
	(have_image Star7 image4)
	(have_image Phenomenon8 image4)
	(have_image Planet9 infrared0)
	(have_image Planet10 infrared3)
	(have_image Star12 image4)
	(have_image Phenomenon13 image4)
	(have_image Phenomenon14 spectrograph1)
	(have_image Star15 spectrograph1)
	(have_image Star16 image2)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 12
2. (turn_to satellite1 groundstation3 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 12
3. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 12
4. (turn_to satellite1 star16 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star16)
   goals met: 0 of 12
5. (take_image satellite1 star16 instrument2 image2)
   added: (have_image star16 image2)
   goals met: 1 of 12
6. (turn_to satellite4 planet9 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 planet9)
   goals met: 2 of 12
7. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 2 of 12
8. (turn_to satellite3 star4 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 star4)
   goals met: 2 of 12
9. (calibrate satellite3 instrument7 star4)
   added: (calibrated instrument7)
   goals met: 2 of 12
10. (turn_to satellite3 phenomenon14 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 phenomenon14)
   goals met: 2 of 12
11. (take_image satellite3 phenomenon14 instrument7 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 3 of 12
12. (turn_to satellite3 phenomenon8 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 phenomenon8)
   goals met: 3 of 12
13. (take_image satellite3 phenomenon8 instrument7 image4)
   added: (have_image phenomenon8 image4)
   goals met: 4 of 12
14. (turn_to satellite3 star15 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 star15)
   goals met: 4 of 12
15. (take_image satellite3 star15 instrument7 spectrograph1)
   added: (have_image star15 spectrograph1)
   goals met: 5 of 12
16. (turn_to satellite3 star7 star15)
   deleted: (pointing satellite3 star15)
   added: (pointing satellite3 star7)
   goals met: 5 of 12
17. (take_image satellite3 star7 instrument7 image4)
   added: (have_image star7 image4)
   goals met: 6 of 12
18. (turn_to satellite3 planet5 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 planet5)
   goals met: 6 of 12
19. (take_image satellite3 planet5 instrument7 image4)
   added: (have_image planet5 image4)
   goals met: 7 of 12
20. (turn_to satellite3 star12 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 star12)
   goals met: 7 of 12
21. (take_image satellite3 star12 instrument7 image4)
   added: (have_image star12 image4)
   goals met: 8 of 12
22. (turn_to satellite3 planet10 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 planet10)
   goals met: 8 of 12
23. (take_image satellite3 planet10 instrument7 infrared3)
   added: (have_image planet10 infrared3)
   goals met: 9 of 12
24. (turn_to satellite3 star6 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 star6)
   goals met: 9 of 12
25. (take_image satellite3 star6 instrument7 infrared3)
   added: (have_image star6 infrared3)
   goals met: 10 of 12
26. (turn_to satellite1 planet9 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 planet9)
   goals met: 10 of 12
27. (take_image satellite1 planet9 instrument2 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 11 of 12
28. (turn_to satellite3 phenomenon13 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 phenomenon13)
   goals met: 11 of 12
29. (take_image satellite3 phenomenon13 instrument7 image4)
   added: (have_image phenomenon13 image4)
   goals met: 12 of 12
